using System; // Хуйню насрал я какую-то, на самом деле это подключение библиотек

namespace HelloWorld // Пространство времен, несколько решений может быть под разными пространствами времен
{ // открытие кода программы
    class Hello // Без задачи класса не работает на C# в принципе программа
    {
        static void Main(string[] args) // Начало проги всегда с Main, это точка входа
        {
            Console.WriteLine("Озон терпел и нам велел"); // Консоль оси открывается и выдает текст
        }
    }
} // закрывает код программы. 
